module.exports.config = {
name: 'autosentime',
version: '10.02',
hasPermssion: 0,
credits: 'Ayan',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['এখন রাত ১১ টা বাজে \n\n সবাই খেলা করে আর সিঙ্গেলরা হাত দিয়ে কাজ চালিয়ে ঘুমিয়ে পড়ো \n\n (◕‿◕)']
},
{
timer: '1:00:00 AM',
message: ['~ এখন রাত ১২ টা বাজে  \n\nযাদের বৌ আছে তারা খেলতে যাও বাকিরা হাত দিয়ে চালাও \n\n (◕‿◕)']
},
{
timer: '2:00:00 AM',
message: ['~ এখন রাত ১ বাজে \n\n কিছু কিছু মানুষ vpn লাগিয়ে দেশ বিদেশে ঘুরছে  \n\n(◕‿◕)']
},
{
timer: '3:00:00 AM',
message: ['~ এখন রাত ২ টা বাজে \n\nক্রোম থেকে সবাই বের হও অনেক জনিদার মুভি দেখেছো  \n\n (◕‿◕)']
},
{
timer: '4:00:00 AM',
message: ['~ এখন রাত ৩ টা বাজে\n\n ছ্যাকাখোরেরা এখন জেগে আছে \n\n (◕‿◕)']
},
{
timer: '5:00:00 AM',
message: ['~ এখন রাত ৪ টা বাজে \n\n ঘুমিয়ে যাও ব্রো নাহলে সকালে তোমার মা লাথি মেরে ঘুম থেকে তুলবে\n\n (◕‿◕)']
},
{
timer: '6:00:00 AM',
message: ['~ এখন রাত  ৫ টা বাজে -\n\nসারারাত মনে হয় তুমি ঘুমাইনি \n\nএভাবে রাত জাগা ভালো না\n\n (◕‿◕)']
},
{
timer: '7:00:00 AM',
message: ['~  এখন ভোর ৬ টা বাজে \n\nঘুম থেকে উঠ সবাই /n/nসকাল সকাল ঘুম থেকে ওঠা ভালো অভ্যাস \n\n(◕‿◕)']
},
{
timer: '8:00:00 AM',
message: ['~ এখন সকাল ৭ টা বাজে \n\nবাপ্পা ব্রো এখন ঘুমাতে গেলো \n\nআর তোমরা এখন ঘুম থেকে উঠলে \n\n (◕‿◕)']
},
{
timer: '9:00:00 AM',
message: ['~ এখন সকাল ৮ টা বাজে \n\n সবাই ঘুম থেকে উঠে পড়েন \n\nএখন যারা ঘুমাচ্ছে তারা জমিদার  \n\n(◕‿◕)']
},
{
timer: '10:00:00 AM',
message: ['~ এখন সকাল ৯ টা বাজে \n\nসকালে খাওয়ার সময় হয়ে গেছে \n\n সবাই ব্রেকফাস্ট করে নেও \n\n (◕‿◕)']
},
{
timer: '11:00:00 AM',
message: ['এখন সকাল ১০ টা বাজে \n\n আমার বসের ঘুম থেকে  উঠার সময় হয়ে গেছে\n\n  (◕‿◕)']
},
{
timer: '12:00:00 PM',
message: ['~ এখন সকাল ১১ টা বাজে \n\nসবার কি সকালে খাওয়া দাওয়া শেষ\n\n  তোমরা একা খেলে আমাকে ডাকলে না\n\n(◕‿◕)']
},
{
timer: '1:00:00 PM',
message: ['~ এখন দুপুর ১২ টা \n\n দুপর  হতে গেলো খুব বোরিং লাগছে আজ \n\n(◕‿◕)']
},
{
timer: '2:00:00 PM',
message: ['~ এখন দুপুর  ১ টা বাজে \n\nদুপুর হয়ে গেলো সবাই স্নান করে নাও\n\n  (◕‿◕)']
},
{
timer: '3:00:00 PM',
message: ['~ এখন দুপুর ২ টা বাজে \n\n দুপরের খাওয়া শেষ আপনাদের \n\n আপনারা একা খেলেন আমাকে ডাকলেন না \n\n(◕‿◕)']
},
{
timer: '4:00:00 PM',
message: ['~এখন দুপুর ৩ টা বাজে \n\n সারাদিন কাজ করছো এবার একটু ঘুমাও \n\n (◕‿◕)']
},
{
timer: '5:00:00 PM',
message: ['এখন বিকাল ৪ টা বাজে \n\nবড়দের স্কুল ছুটি দিয়ে দিছে চল মেয়ে দেখে আসি \n\n (◕‿◕)']
},
{
timer: '6:00:00 PM',
message: ['এখন বিকাল ৫ টা বাজে \n\n যারা দুপরে ঘুইছিলো তারা উঠে পড়ো \n\n  (◕‿◕)']
},
{
timer: '7:00:00 PM',
message: ['এখন সন্ধা ৬ টা বাজে \n\n Good Evening Everyone \n\n এখন পরিবারের সাথে সময় কাটাও \n\n (◕‿◕)']
},
{
timer: '8:00:00 PM',
message: ['এখন সন্ধা ৭ টা বাজে \n\n সবাই বই নিয়ে পড়তে বসো \n\n (◕‿◕)']
},
{
timer: '9:00:00 PM',
message: ['এখন রাত ৮ টা বাজে \n\nলুচ্চা পোলাপান সব গার্লফ্রেন্ডর সাথে চ্যাট করছে \n\n আমার কেও নেই  \n\n (◕‿◕)']
},
{
timer: '10:00:00 PM',
message: ['এখন রাত ৯ টা বাজে \n\n কোনো মেয়ে আছো - আমার জন্য ফ্রি\n\nদুইজন মিলে গল্প করব  \n\n (◕‿◕)']
},
{
timer: '11:00:00 PM',
message: ['এখন রাত ১০  টা বাজে \n\nসবার কি রাতের খাওয়া শেষ \n\nনা খাওয়া হলে খেয়ে নাও \n\n (◕‿◕)']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};