module.exports.config = {
	name: "offbot",
	version: "1.0.0",
	hasPermssion: 2,
	credits: "HTHB",
	description: "Off Bot",
	commandCategory: "System",
	cooldowns: 0
        };
module.exports.run = ({event, api}) =>api.sendMessage("Bye I love you ummmah,🥰 আপনাদের সবার সাথে অনেক মজা করলাম যদি কোন ভুল হয়ে থাকে মাফ করে দিবেন😍🥰 বস  এর আদেশ আমি আর এখন কথা বলতে পারবো না😥 আপনাদের সাথে আমার আবার কথা হবে যখন আমার বস ๛➣𓆩𝐁𝐀𝐏𝐏𝐀᭄𓆪‣𒁍 অনুমতি দিবে😍 তাই এখন এর জন্য বিদায়💔!!!",event.threadID, () =>process.exit(0))